Can't keep the highlighted [Element]s joined.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotKeepTrussJoined { get; }
  Visual Basic
Public Shared ReadOnly Property CannotKeepTrussJoined As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotKeepTrussJoined {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures JoinElementsFailures Class
  Autodesk.Revit.DB Namespace